docs(lib-network-protocol): use mermaid diagram on receiver readme.md
